{
    "Similar": {
        "Info": [
            {
                "Name": "The Avengers",
                "Type": "movie",
                "wTeaser": "Marvel's The Avengers (classified under the name Marvel Avengers Assemble in the United Kingdom and Ireland), or simply The Avengers, is a 2012 American superhero film based on the Marvel Comics superhero team of the same name, produced by Marvel Studios and distributed by Walt Disney Studios Motion Pictures. It is the sixth film in the Marvel Cinematic Universe (MCU). The film was written and directed by Joss Whedon and features an ensemble cast that includes Robert Downey Jr., Chris Evans, Mark Ruffalo, Chris Hemsworth, Scarlett Johansson, and Jeremy Renner as the titular Avengers team, alongside Tom Hiddleston, Clark Gregg, Cobie Smulders, Stellan Skarsgård, and Samuel L. Jackson. In the film, Nick Fury, director of the spy agency S.H.I.E.L.D., recruits Tony Stark, Steve Rogers, Bruce Banner, and Thor to form a team that must stop Thor's brother Loki from subjugating Earth.",
                "wUrl": "http://en.wikipedia.org/wiki/The_Avengers_(2012_film)",
                "yUrl": "https://www.youtube-nocookie.com/embed/eOrNdBpGMv8",
                "yID": "eOrNdBpGMv8"
            }
        ],
        "Results": [
            {
                "Name": "Captain America: The First Avenger",
                "Type": "movie",
                "wTeaser": "Captain America: The First Avenger is a 2011 American superhero film based on the Marvel Comics character Captain America. Produced by Marvel Studios and distributed by Paramount Pictures, it is the fifth film in the Marvel Cinematic Universe (MCU). The film was directed by Joe Johnston, written by Christopher Markus and Stephen McFeely, and stars Chris Evans as Steve Rogers / Captain America, alongside Tommy Lee Jones, Hugo Weaving, Hayley Atwell, Sebastian Stan, Dominic Cooper, Neal McDonough, Derek Luke, and Stanley Tucci. Set predominantly during World War II, the film tells the story of Steve Rogers, a sickly man from Brooklyn who is transformed into the super-soldier Captain America and must stop the Red Skull, who intends to use an artifact called the Tesseract as an energy-source for world domination.",
                "wUrl": "http://en.wikipedia.org/wiki/Captain_America:_The_First_Avenger",
                "yUrl": "https://www.youtube-nocookie.com/embed/JerVrbLldXw",
                "yID": "JerVrbLldXw"
            },
            {
                "Name": "Iron Man 3",
                "Type": "movie",
                "wTeaser": "Iron Man 3 is a 2013 American superhero film based on the Marvel Comics character Iron Man, produced by Marvel Studios and distributed by Walt Disney Studios Motion Pictures. It is the sequel to 2008's Iron Man and 2010's Iron Man 2, and the seventh film in the Marvel Cinematic Universe (MCU). The film was directed by Shane Black from a screenplay he co-wrote with Drew Pearce, and stars Robert Downey Jr. as Tony Stark / Iron Man, alongside Gwyneth Paltrow, Don Cheadle, Guy Pearce, Rebecca Hall, Stéphanie Szostak, James Badge Dale, Jon Favreau, and Ben Kingsley. In Iron Man 3, Tony Stark wrestles with the ramifications of the events of The Avengers, during a national terrorism campaign on the United States led by the mysterious Mandarin.",
                "wUrl": "http://en.wikipedia.org/wiki/Iron_Man_3",
                "yUrl": "https://www.youtube-nocookie.com/embed/Ke1Y3P9D0Bc",
                "yID": "Ke1Y3P9D0Bc"
            },
            {
                "Name": "Iron Man 2",
                "Type": "movie",
                "wTeaser": "Iron Man 2 is a 2010 American superhero film based on the Marvel Comics character Iron Man, produced by Marvel Studios and distributed by Paramount Pictures. It is the sequel to 2008's Iron Man, and the third film in the Marvel Cinematic Universe (MCU). Directed by Jon Favreau and written by Justin Theroux, the film stars Robert Downey Jr. as Tony Stark / Iron Man, alongside Gwyneth Paltrow, Don Cheadle, Scarlett Johansson, Sam Rockwell, Mickey Rourke, and Samuel L. Jackson. Six months after the events of Iron Man, Tony Stark is resisting calls by the United States government to hand over the Iron Man technology while also combating his declining health from the arc reactor in his chest. Meanwhile, rogue Russian scientist Ivan Vanko has developed the same technology and built weapons of his own in order to pursue a vendetta against the Stark family, in the process, joining forces with Stark's business rival, Justin Hammer.",
                "wUrl": "http://en.wikipedia.org/wiki/Iron_Man_2",
                "yUrl": "https://www.youtube-nocookie.com/embed/BoohRoVA9WQ",
                "yID": "BoohRoVA9WQ"
            },
            {
                "Name": "The Amazing Spider-Man",
                "Type": "movie",
                "wTeaser": "The Amazing Spider-Man is a 2012 American superhero film based on the Marvel Comics character Spider-Man, and sharing the title of the character's longest-running comic book series. It is the fourth theatrical Spider-Man film produced by Columbia Pictures and Marvel Entertainment, a reboot of the series following Sam Raimi's 2002–2007 Spider-Man trilogy, and the first film in The Amazing Spider-Man duology. The film was directed by Marc Webb from a screenplay by James Vanderbilt, Alvin Sargent and Steve Kloves, and stars Andrew Garfield, Emma Stone, Rhys Ifans, Denis Leary, Campbell Scott, Irrfan Khan, Martin Sheen, and Sally Field.After Peter Parker is bitten by a genetically altered spider, he gains newfound, spider-like powers and ventures out to save the city from the machinations of a mysterious reptilian foe.",
                "wUrl": "http://en.wikipedia.org/wiki/The_Amazing_Spider-Man_(2012_film)",
                "yUrl": "https://www.youtube-nocookie.com/embed/VWMZAZkFDbk",
                "yID": "VWMZAZkFDbk"
            }
        ]
    }
}
