{
    "Similar": {
        "Info": [
            {
                "Name": "The Avengers",
                "Type": "movie",
                "wTeaser": "Marvel's The Avengers (classified under the name Marvel Avengers Assemble in the United Kingdom and Ireland), or simply The Avengers, is a 2012 American superhero film based on the Marvel Comics superhero team of the same name, produced by Marvel Studios and distributed by Walt Disney Studios Motion Pictures. It is the sixth film in the Marvel Cinematic Universe (MCU). The film was written and directed by Joss Whedon and features an ensemble cast that includes Robert Downey Jr., Chris Evans, Mark Ruffalo, Chris Hemsworth, Scarlett Johansson, and Jeremy Renner as the titular Avengers team, alongside Tom Hiddleston, Clark Gregg, Cobie Smulders, Stellan Skarsgård, and Samuel L. Jackson. In the film, Nick Fury, director of the spy agency S.H.I.E.L.D., recruits Tony Stark, Steve Rogers, Bruce Banner, and Thor to form a team that must stop Thor's brother Loki from subjugating Earth.",
                "wUrl": "http://en.wikipedia.org/wiki/The_Avengers_(2012_film)",
                "yUrl": "https://www.youtube-nocookie.com/embed/eOrNdBpGMv8",
                "yID": "eOrNdBpGMv8"
            }
        ],
        "Results": [
            {
                "Name": "Captain America: The First Avenger",
                "Type": "movie",
                "wTeaser": "Captain America: The First Avenger is a 2011 American superhero film based on the Marvel Comics character Captain America. Produced by Marvel Studios and distributed by Paramount Pictures, it is the fifth film in the Marvel Cinematic Universe (MCU). The film was directed by Joe Johnston, written by Christopher Markus and Stephen McFeely, and stars Chris Evans as Steve Rogers / Captain America, alongside Tommy Lee Jones, Hugo Weaving, Hayley Atwell, Sebastian Stan, Dominic Cooper, Neal McDonough, Derek Luke, and Stanley Tucci. Set predominantly during World War II, the film tells the story of Steve Rogers, a sickly man from Brooklyn who is transformed into the super-soldier Captain America and must stop the Red Skull, who intends to use an artifact called the Tesseract as an energy-source for world domination.",
                "wUrl": "http://en.wikipedia.org/wiki/Captain_America:_The_First_Avenger",
                "yUrl": "https://www.youtube-nocookie.com/embed/JerVrbLldXw",
                "yID": "JerVrbLldXw"
            },
            {
                "Name": "Iron Man 3",
                "Type": "movie",
                "wTeaser": "Iron Man 3 is a 2013 American superhero film based on the Marvel Comics character Iron Man, produced by Marvel Studios and distributed by Walt Disney Studios Motion Pictures. It is the sequel to 2008's Iron Man and 2010's Iron Man 2, and the seventh film in the Marvel Cinematic Universe (MCU). The film was directed by Shane Black from a screenplay he co-wrote with Drew Pearce, and stars Robert Downey Jr. as Tony Stark / Iron Man, alongside Gwyneth Paltrow, Don Cheadle, Guy Pearce, Rebecca Hall, Stéphanie Szostak, James Badge Dale, Jon Favreau, and Ben Kingsley. In Iron Man 3, Tony Stark wrestles with the ramifications of the events of The Avengers, during a national terrorism campaign on the United States led by the mysterious Mandarin.",
                "wUrl": "http://en.wikipedia.org/wiki/Iron_Man_3",
                "yUrl": "https://www.youtube-nocookie.com/embed/Ke1Y3P9D0Bc",
                "yID": "Ke1Y3P9D0Bc"
            },
            {
                "Name": "Iron Man 2",
                "Type": "movie",
                "wTeaser": "Iron Man 2 is a 2010 American superhero film based on the Marvel Comics character Iron Man, produced by Marvel Studios and distributed by Paramount Pictures. It is the sequel to 2008's Iron Man, and the third film in the Marvel Cinematic Universe (MCU). Directed by Jon Favreau and written by Justin Theroux, the film stars Robert Downey Jr. as Tony Stark / Iron Man, alongside Gwyneth Paltrow, Don Cheadle, Scarlett Johansson, Sam Rockwell, Mickey Rourke, and Samuel L. Jackson. Six months after the events of Iron Man, Tony Stark is resisting calls by the United States government to hand over the Iron Man technology while also combating his declining health from the arc reactor in his chest. Meanwhile, rogue Russian scientist Ivan Vanko has developed the same technology and built weapons of his own in order to pursue a vendetta against the Stark family, in the process, joining forces with Stark's business rival, Justin Hammer.",
                "wUrl": "http://en.wikipedia.org/wiki/Iron_Man_2",
                "yUrl": "https://www.youtube-nocookie.com/embed/BoohRoVA9WQ",
                "yID": "BoohRoVA9WQ"
            },
            {
                "Name": "The Amazing Spider-Man",
                "Type": "movie",
                "wTeaser": "The Amazing Spider-Man is a 2012 American superhero film based on the Marvel Comics character Spider-Man, and sharing the title of the character's longest-running comic book series. It is the fourth theatrical Spider-Man film produced by Columbia Pictures and Marvel Entertainment, a reboot of the series following Sam Raimi's 2002–2007 Spider-Man trilogy, and the first film in The Amazing Spider-Man duology. The film was directed by Marc Webb from a screenplay by James Vanderbilt, Alvin Sargent and Steve Kloves, and stars Andrew Garfield, Emma Stone, Rhys Ifans, Denis Leary, Campbell Scott, Irrfan Khan, Martin Sheen, and Sally Field.After Peter Parker is bitten by a genetically altered spider, he gains newfound, spider-like powers and ventures out to save the city from the machinations of a mysterious reptilian foe.",
                "wUrl": "http://en.wikipedia.org/wiki/The_Amazing_Spider-Man_(2012_film)",
                "yUrl": "https://www.youtube-nocookie.com/embed/VWMZAZkFDbk",
                "yID": "VWMZAZkFDbk"
            },
            {
                "Name": "Thor: The Dark World",
                "Type": "movie",
                "wTeaser": "Thor: The Dark World is a 2013 American superhero film based on the Marvel Comics character Thor, produced by Marvel Studios and distributed by Walt Disney Studios Motion Pictures. It is the sequel to 2011's Thor and the eighth film in the Marvel Cinematic Universe (MCU). The film was directed by Alan Taylor, with a screenplay by Christopher Yost and the writing team of Christopher Markus and Stephen McFeely. It stars Chris Hemsworth as Thor, alongside Natalie Portman, Tom Hiddleston, Anthony Hopkins, Stellan Skarsgård, Idris Elba, Christopher Eccleston, Adewale Akinnuoye-Agbaje, Kat Dennings, Ray Stevenson, Zachary Levi, Tadanobu Asano, Jaimie Alexander, and Rene Russo. In Thor: The Dark World, Thor teams up with Loki to save the Nine Realms from the Dark Elves led by the vengeful Malekith, who intends to plunge the universe into darkness.",
                "wUrl": "http://en.wikipedia.org/wiki/Thor:_The_Dark_World",
                "yUrl": "https://www.youtube-nocookie.com/embed/npvJ9FTgZbM",
                "yID": "npvJ9FTgZbM"
            },
            {
                "Name": "Thor",
                "Type": "movie",
                "wTeaser": "Thor is a 2011 American superhero film based on the Marvel Comics character of the same name. Produced by Marvel Studios and distributed by Paramount Pictures, it is the fourth film in the Marvel Cinematic Universe (MCU). The film was directed by Kenneth Branagh, written by the writing team of Ashley Edward Miller and Zack Stentz along with Don Payne, and stars Chris Hemsworth as the title character, alongside Natalie Portman, Tom Hiddleston, Stellan Skarsgård, Colm Feore, Ray Stevenson, Idris Elba, Kat Dennings, Rene Russo, and Anthony Hopkins. The film sees Thor banished to Earth from Asgard, stripped of his powers and his hammer Mjölnir, after reigniting a dormant war. As his brother Loki plots to take the Asgardian throne, Thor must prove himself worthy.",
                "wUrl": "https://en.wikipedia.org/wiki/Thor_(film)",
                "yUrl": "https://www.youtube-nocookie.com/embed/JOddp-nlNvQ",
                "yID": "JOddp-nlNvQ"
            },
            {
                "Name": "Hulk",
                "Type": "movie",
                "wTeaser": "Hulk is a 2003 American superhero film based on the fictional Marvel Comics character of the same name. It was directed by Ang Lee and written by James Schamus, Michael France, and John Turman, from a story by Schamus.  Eric Bana stars as Bruce Banner / Hulk, alongside Jennifer Connelly, Sam Elliott, Josh Lucas, and Nick Nolte. The film explores the origins of Bruce Banner, who after a lab accident involving gamma radiation, finds himself able to turn into a huge green-skinned monster whenever he is emotionally provoked or stressed, while he is pursued by the United States military and comes into a conflict with his biological father, who has his own dark agenda for his son.Development for the film started as far back as 1990. The film was at one point to be directed by Joe Johnston and then Jonathan Hensleigh. More scripts had been written by Hensleigh, John Turman, Michael France, Zak Penn (who would go on to write The Incredible Hulk), J. J. Abrams, Scott Alexander and Larry Karaszewski, Michael Tolkin, and David Hayter before Ang Lee and James Schamus' involvement. Hulk was shot mostly in California, primarily in the San Francisco Bay Area.",
                "wUrl": "https://en.wikipedia.org/wiki/Hulk_(film)",
                "yUrl": "https://www.youtube-nocookie.com/embed/2ErnLuJKQA4",
                "yID": "2ErnLuJKQA4"
            },
            {
                "Name": "Captain America",
                "Type": "movie",
                "wTeaser": "Captain America is a 1990 Yugoslavian-American superhero film directed by Albert Pyun and written by Stephen Tolkin and Lawrence J. Block (aka Larry Block). The film is based on the Marvel Comics superhero of the same name. While the film takes several liberties with the comic's storyline, it features Steve Rogers becoming Captain America during World War II to battle the Red Skull, being frozen in ice, and subsequently being revived to save the President of the United States from a crime family that dislikes his environmentalist policies.The film opens in Porto Venere, Fascist Italy in 1936. The government kidnaps a child prodigy, Tadzio de Santis, and kills his family. The child is needed for an experimental project to create a Fascist supersoldier. The procedure's inventor, Dr. Maria Vaselli, objects to the cruelty of using the boy, and, under the cover of gunfire, flees to the United States to offer her services to the Americans.",
                "wUrl": "https://en.wikipedia.org/wiki/Captain_America_(1990_film)",
                "yUrl": "https://www.youtube-nocookie.com/embed/cs8rFsmhNTc",
                "yID": "cs8rFsmhNTc"
            },
            {
                "Name": "X-Men: First Class",
                "Type": "movie",
                "wTeaser": "X-Men: First Class (also marketed as  X: First Class) is a 2011 superhero film based on the X-Men characters appearing in Marvel Comics. The fifth installment in the X-Men film series, a prequel and soft reboot of X-Men (2000), it was directed by Matthew Vaughn and produced by Bryan Singer, and stars James McAvoy, Michael Fassbender, Rose Byrne, January Jones, Oliver Platt, and Kevin Bacon. The film is set primarily in 1962 during the Cuban Missile Crisis, and focuses on the relationship between Professor Charles Xavier and Erik Lehnsherr / Magneto, and the origin of their groups—the X-Men and the Brotherhood of Mutants, respectively, as they deal with the Hellfire Club led by Sebastian Shaw, who is bent on world domination.",
                "wUrl": "http://en.wikipedia.org/wiki/X-Men:_First_Class_(film)",
                "yUrl": "https://www.youtube-nocookie.com/embed/kyQKi5-k0UU",
                "yID": "kyQKi5-k0UU"
            },
            {
                "Name": "Green Lantern",
                "Type": "movie",
                "wTeaser": "Green Lantern is a 2011 American superhero film based on the DC Comics character of the same name. The film stars Ryan Reynolds, Blake Lively, Peter Sarsgaard, Mark Strong, Angela Bassett and Tim Robbins, with Martin Campbell directing a script by Greg Berlanti and comic book writers Michael Green and Marc Guggenheim, which was subsequently rewritten by Michael Goldenberg. The film tells the story of Hal Jordan, a test pilot who is selected to become the first human member of the Green Lantern Corps. Hal is given a ring that grants him superpowers, and must confront Parallax, who threatens to upset the balance of power in the universe.The film first entered development in 1997; progress remained stalled until Greg Berlanti was hired to write and direct in October 2007. Martin Campbell was brought on board in February 2009 after Berlanti was forced to vacate the director's position. Most of the live-action actors were cast between July 2009 and February 2010, and filming took place from March to August 2010 in Louisiana. The film was converted to 3D during its post-production stage.",
                "wUrl": "http://en.wikipedia.org/wiki/Green_Lantern_(film)",
                "yUrl": "https://www.youtube-nocookie.com/embed/_axLoYlwwmU",
                "yID": "_axLoYlwwmU"
            },
            {
                "Name": "Captain America: The Winter Soldier",
                "Type": "movie",
                "wTeaser": "Captain America: The Winter Soldier is a 2014 American superhero film based on the Marvel Comics character Captain America, produced by Marvel Studios and distributed by Walt Disney Studios Motion Pictures. It is the sequel to 2011's Captain America: The First Avenger and the ninth film in the Marvel Cinematic Universe (MCU). The film was directed by Anthony and Joe Russo, with a screenplay by the writing team of Christopher Markus and Stephen McFeely. It stars Chris Evans as Steve Rogers / Captain America, alongside Scarlett Johansson, Sebastian Stan, Anthony Mackie, Cobie Smulders, Frank Grillo, Emily VanCamp, Hayley Atwell, Robert Redford, and Samuel L. Jackson. In Captain America: The Winter Soldier, Captain America, Black Widow, and Falcon join forces to uncover a conspiracy within S.H.I.E.L.D. while facing a mysterious assassin known as the Winter Soldier.",
                "wUrl": "http://en.wikipedia.org/wiki/Captain_America:_The_Winter_Soldier",
                "yUrl": "https://www.youtube-nocookie.com/embed/7SlILk2WMTI",
                "yID": "7SlILk2WMTI"
            },
            {
                "Name": "Transformers: Dark Of The Moon",
                "Type": "movie",
                "wTeaser": "Transformers: Dark of the Moon is a 2011 American science fiction action film directed by Michael Bay, and it is based on the Transformers toy line. It is the third installment in the live-action Transformers film series, and is the sequel to 2009's Revenge of the Fallen. It is also the first film in the series that was not co-produced by DreamWorks, leaving Paramount Pictures as the sole distributor. The film stars Shia LaBeouf, Josh Duhamel, John Turturro, Tyrese Gibson, Rosie Huntington-Whiteley, Patrick Dempsey, Kevin Dunn, Julie White, John Malkovich, and Frances McDormand. Set three years after Revenge of the Fallen, this follows the warring Autobots and Decepticons' last days of the war as they battle to possess powerful technology from their homeworld crashed on Earth's Moon to restore their home. Returning Transformers include Optimus Prime, Bumblebee, Ironhide, Ratchet, Sideswipe, Wheelie, Megatron, Starscream, Soundwave, and Barricade.",
                "wUrl": "http://en.wikipedia.org/wiki/Transformers:_Dark_of_the_Moon",
                "yUrl": "https://www.youtube-nocookie.com/embed/kHRf01Gjosk",
                "yID": "kHRf01Gjosk"
            },
            {
                "Name": "The Amazing Spider-Man 2",
                "Type": "movie",
                "wTeaser": "The Amazing Spider-Man 2 (internationally marketed as The Amazing Spider-Man 2: Rise of Electro) is a 2014 American superhero film featuring the Marvel Comics character Spider-Man. The film was directed by Marc Webb and produced by Avi Arad and Matt Tolmach. It is the fifth theatrical Spider-Man film produced by Columbia Pictures and Marvel Entertainment, the sequel to 2012's The Amazing Spider-Man and the second and final film in The Amazing Spider-Man duology. The studio hired James Vanderbilt to write the screenplay and Alex Kurtzman and Roberto Orci to rewrite it. The film stars Andrew Garfield as Peter Parker / Spider-Man, alongside Emma Stone, Jamie Foxx, Dane DeHaan, Campbell Scott, Embeth Davidtz, Colm Feore, Paul Giamatti, and Sally Field.",
                "wUrl": "http://en.wikipedia.org/wiki/The_Amazing_Spider-Man_2",
                "yUrl": "https://www.youtube-nocookie.com/embed/DlM2CWNTQ84",
                "yID": "DlM2CWNTQ84"
            },
            {
                "Name": "The Wolverine",
                "Type": "movie",
                "wTeaser": "The Wolverine is a 2013 superhero film featuring the Marvel Comics character Wolverine. Distributed by 20th Century Fox, it is the sixth installment in the X-Men film series, the second installment in the trilogy of Wolverine films, a standalone sequel to X-Men Origins: Wolverine (2009) and a direct sequel to X-Men: The Last Stand (2006). Directed by James Mangold, from a screenplay written by Scott Frank and Mark Bomback, based on the 1982 limited series Wolverine by Chris Claremont and Frank Miller, it stars Hugh Jackman as Logan / Wolverine, alongside Rila Fukushima, Hiroyuki Sanada, Famke Janssen, and Will Yun Lee. Following the events of X-Men: The Last Stand, Logan travels to Japan, where he engages an old acquaintance in a struggle that has lasting consequences. Stripped of his healing powers, Wolverine must battle deadly samurai while struggling with guilt over Jean Grey's death.",
                "wUrl": "http://en.wikipedia.org/wiki/The_Wolverine_%28film%29",
                "yUrl": "https://www.youtube-nocookie.com/embed/toLpchTUYk8",
                "yID": "toLpchTUYk8"
            },
            {
                "Name": "Sherlock Holmes: A Game Of Shadows",
                "Type": "movie",
                "wTeaser": "Sherlock Holmes: A Game of Shadows is a 2011 period action mystery film directed by Guy Ritchie and produced by Joel Silver, Lionel Wigram, Susan Downey, and Dan Lin. It is the sequel to the 2009 film Sherlock Holmes, and features the Sherlock Holmes and Dr. John Watson characters created by Sir Arthur Conan Doyle. The film's screenplay was written by Michele Mulroney and Kieran Mulroney. Robert Downey Jr. and Jude Law reprise their roles as Holmes and Watson, alongside Noomi Rapace as Simza, Stephen Fry as Mycroft Holmes, Jared Harris as Professor Moriarty and Rachel McAdams as Irene Adler. Although the film follows an original premise, it incorporates elements of Conan Doyle's short stories \"The Final Problem\" and \"The Adventure of the Empty House\". In the film, Holmes and Watson travel across Europe with a Romani adventuress to foil an intricate plot by their cunning nemesis, Professor Moriarty, to instigate a war.",
                "wUrl": "http://en.wikipedia.org/wiki/Sherlock_Holmes:_A_Game_of_Shadows",
                "yUrl": "https://www.youtube-nocookie.com/embed/DpxtbtnC1u8",
                "yID": "DpxtbtnC1u8"
            },
            {
                "Name": "The Incredible Hulk",
                "Type": "movie",
                "wTeaser": "The Incredible Hulk is a 2008 American superhero film based on the Marvel Comics character the Hulk, produced by Marvel Studios and distributed by Universal Pictures. It is the second film in the Marvel Cinematic Universe (MCU). The film was directed by Louis Leterrier, with a screenplay by Zak Penn. It stars Edward Norton as Bruce Banner, alongside Liv Tyler, Tim Roth, Tim Blake Nelson, Ty Burrell, and William Hurt. In The Incredible Hulk, Bruce Banner becomes the Hulk as an unwitting pawn in a military scheme to reinvigorate the \"Super-Soldier\" program through gamma radiation. On the run, he attempts to cure himself of the Hulk before he is captured by General Thaddeus Ross, but his worst fears are realized when power-hungry soldier Emil Blonsky becomes a similar, but more bestial creature.",
                "wUrl": "http://en.wikipedia.org/wiki/The_Incredible_Hulk_(film)",
                "yUrl": "https://www.youtube-nocookie.com/embed/xbqNb2PFKKA",
                "yID": "xbqNb2PFKKA"
            },
            {
                "Name": "Man Of Steel",
                "Type": "movie",
                "wTeaser": "Man of Steel is a 2013 superhero film based on the DC Comics character Superman. Produced by DC Entertainment, Legendary Pictures and Syncopy, and distributed by Warner Bros. Pictures, it is a British-American production and the first installment in the DC Extended Universe (DCEU). The film is directed by Zack Snyder, written by David S. Goyer, and stars Henry Cavill, Amy Adams, Michael Shannon, Kevin Costner, Diane Lane, Laurence Fishburne, Antje Traue, Ayelet Zurer, Christopher Meloni and Russell Crowe. Man of Steel is a reboot of the Superman film series that portrays the character's origin story. In the film, Clark Kent learns that he is a superpowered alien from the planet Krypton. He assumes the role of mankind's protector as Superman, making the choice to face General Zod and prevent him from destroying humanity.",
                "wUrl": "http://en.wikipedia.org/wiki/Man_of_Steel_(film_project)",
                "yUrl": "https://www.youtube-nocookie.com/embed/T6DJcgm3wNY",
                "yID": "T6DJcgm3wNY"
            },
            {
                "Name": "Captain America: Civil War",
                "Type": "movie",
                "wTeaser": "Captain America: Civil War is a 2016 American superhero film based on the Marvel Comics character Captain America, produced by Marvel Studios and distributed by Walt Disney Studios Motion Pictures. It is the sequel to 2011's Captain America: The First Avenger and 2014's Captain America: The Winter Soldier, and the 13th film in the Marvel Cinematic Universe (MCU). The film is directed by Anthony and Joe Russo, with a screenplay by the writing team of Christopher Markus and Stephen McFeely, and stars Chris Evans as Steve Rogers / Captain America, alongside an ensemble cast including Robert Downey Jr., Scarlett Johansson, Sebastian Stan, Anthony Mackie, Don Cheadle, Jeremy Renner, Chadwick Boseman, Paul Bettany, Elizabeth Olsen, Paul Rudd, Emily VanCamp, Tom Holland, Frank Grillo, William Hurt, and Daniel Brühl. In Captain America: Civil War, disagreement over international oversight of the Avengers fractures them into opposing factions—one led by Steve Rogers and the other by Tony Stark.",
                "wUrl": "https://en.wikipedia.org/wiki/Captain_America:_Civil_War",
                "yUrl": "https://www.youtube-nocookie.com/embed/FkTybqcX-Yo",
                "yID": "FkTybqcX-Yo"
            },
            {
                "Name": "Real Steel",
                "Type": "movie",
                "wTeaser": "Real Steel is a 2011 American science-fiction sports film starring Hugh Jackman and Dakota Goyo and co-produced and directed by Shawn Levy for DreamWorks Pictures. The film is based on the short story \"Steel\", written by Richard Matheson, which was originally published in the May 1956 edition of The Magazine of Fantasy & Science Fiction, and later adapted into a 1963 Twilight Zone episode. Real Steel was in development for several years before production began on June 24, 2010. Filming took place primarily in the U.S. state of Michigan. Animatronic robots were built for the film, and motion capture technology was used to depict the rodeo brawling of computer-generated robots and animatronics.",
                "wUrl": "http://en.wikipedia.org/wiki/Real_Steel",
                "yUrl": "https://www.youtube-nocookie.com/embed/T75j9CoBVzE",
                "yID": "T75j9CoBVzE"
            },
            {
                "Name": "Men In Black 3",
                "Type": "movie",
                "wTeaser": "Men in Black 3 (alternatively Men in Black III, and stylized as MIB³) is a 2012 American science fiction action film directed by Barry Sonnenfeld and starring Will Smith, Tommy Lee Jones and Josh Brolin. It is the third installment in the Men in Black film series which in turn is loosely based on the comic book series The Men in Black by Lowell Cunningham. It was released fifteen years after the original Men in Black (1997) and ten years after the first sequel, Men in Black II (2002). Sonnenfeld and Steven Spielberg returned as director and executive producer, respectively. In the film, Boris the Animal, an old enemy of Agent K, escapes from prison and travels back in time to kill the younger K in order to allow his species, a ruthless alien race known as Boglodites, to attack Earth. This forces Agent J to go back in time and team up with K's younger self to save his partner and the world.",
                "wUrl": "http://en.wikipedia.org/wiki/Men_in_Black_3",
                "yUrl": "https://www.youtube-nocookie.com/embed/IyaFEBI_L24",
                "yID": "IyaFEBI_L24"
            }
        ]
    }
}
