{
    "Similar": {
        "Info": [
            {
                "Name": "Finding Nemo",
                "Type": "movie",
                "wTeaser": "Finding Nemo is a 2003 American computer-animated adventure film produced by Pixar Animation Studios and released by Walt Disney Pictures. Directed and co-written by Andrew Stanton with co-direction by Lee Unkrich, the screenplay was written by Bob Peterson, David Reynolds, and Stanton from a story by Stanton. The film stars the voices of Albert Brooks, Ellen DeGeneres, Alexander Gould, and Willem Dafoe. It tells the story of an overprotective clownfish named Marlin, who, along with a regal blue tang named Dory searches for his missing son Nemo. Along the way, Marlin learns to take risks and comes to terms with Nemo taking care of himself.Finding Nemo was released on May 30, 2003, to positive reviews with praise to its animation, story, characters, and voice acting. The film won the Academy Award for Best Animated Feature, the first Pixar film to do so. It was also nominated in three more categories, including Best Original Screenplay. Additionally, it became the highest-grossing animated film at the time of its release, and was the second-highest-grossing film of 2003, earning a total of $871 million worldwide by the end of its initial theatrical run.",
                "wUrl": "http://en.wikipedia.org/wiki/Finding_Nemo",
                "yUrl": "https://www.youtube-nocookie.com/embed/9oQ628Seb9w",
                "yID": "9oQ628Seb9w"
            }
        ],
        "Results": [
            {
                "Name": "Cars",
                "Type": "movie",
                "wTeaser": "Cars is a 2006 American computer-animated road-comedy film produced by Pixar Animation Studios and released by Walt Disney Pictures. Directed and co-written by John Lasseter from a screenplay by Dan Fogelman, it was Pixar's final independently produced film before its purchase by Disney in January 2006. Set in a world populated entirely by anthropomorphic talking cars and other vehicles, the film stars the voices of Owen Wilson, Paul Newman (in his final acting role), Bonnie Hunt, Larry the Cable Guy, Tony Shalhoub, Cheech Marin, Michael Wallis, George Carlin, Paul Dooley, Jenifer Lewis, Guido Quaroni, Michael Keaton, Katherine Helmond, John Ratzenberger and Richard Petty, while race car drivers Dale Earnhardt Jr. (as \"Junior\"), Mario Andretti, Michael Schumacher and car enthusiast Jay Leno (as \"Jay Limo\") voice themselves.",
                "wUrl": "http://en.wikipedia.org/wiki/Cars_(film)",
                "yUrl": "https://www.youtube-nocookie.com/embed/SbXIj2T-_uk",
                "yID": "SbXIj2T-_uk"
            },
            {
                "Name": "Toy Story",
                "Type": "movie",
                "wTeaser": "Toy Story is a 1995 American computer-animated buddy comedy film produced by Pixar Animation Studios and released by Walt Disney Pictures. The feature film directorial debut of John Lasseter, it was the first entirely computer-animated feature film, as well as the first feature film from Pixar. The screenplay was written by Joss Whedon, Andrew Stanton, Joel Cohen, and Alec Sokolow from a story by Lasseter, Stanton, Pete Docter, and Joe Ranft. The film features music by Randy Newman, was produced by Bonnie Arnold and Ralph Guggenheim, and was executive-produced by Steve Jobs and Edwin Catmull. It features the voices of Tom Hanks, Tim Allen, Don Rickles, Wallace Shawn, John Ratzenberger, Jim Varney, Annie Potts, R. Lee Ermey, John Morris, Laurie Metcalf, and Erik von Detten.",
                "wUrl": "http://en.wikipedia.org/wiki/Toy_Story_(movie)",
                "yUrl": "https://www.youtube-nocookie.com/embed/h9hsA-LjQtk",
                "yID": "h9hsA-LjQtk"
            },
            {
                "Name": "Nemo",
                "Type": "movie",
                "wTeaser": "Nemoest un film franco-britannique d'Arnaud Sélignac, sorti en 1984.Profitant de l'absence de ses parents, un petit garçon vivant dans un gratte-ciel à Manhattan prend l'ascenseur. Mais l'appareil accélère et ne s'arrête que sur un autre monde, où le soleil ne se lève jamais et où la neige est bleue.",
                "wUrl": "https://fr.wikipedia.org/wiki/Nemo_(film,_1984)",
                "yUrl": "https://www.youtube-nocookie.com/embed/JyR51psl15c",
                "yID": "JyR51psl15c"
            },
            {
                "Name": "Shrek Forever After",
                "Type": "movie",
                "wTeaser": "Shrek Forever After (previously promoted as Shrek: The Final Chapter) is a 2010 American computer-animated comedy film produced by DreamWorks Animation and distributed by Paramount Pictures. It is the fourth installment in the Shrek film franchise and the sequel to Shrek the Third (2007). The film was directed by Mike Mitchell from a screenplay by Josh Klausner and Darren Lemke, and stars Mike Myers, Eddie Murphy, Cameron Diaz, Antonio Banderas, Julie Andrews, and John Cleese reprising their previous roles, with Walt Dohrn introduced in the role of Rumpelstiltskin. The plot follows Shrek struggling as a family man with no privacy, who yearns for the days when he was once feared. He is tricked by Rumpelstiltskin into signing a contract that allows him to relive his golden age, but comes to realize that it comes alongside disastrous consequences.",
                "wUrl": "http://en.wikipedia.org/wiki/Shrek_Forever_After",
                "yUrl": "https://www.youtube-nocookie.com/embed/u7__TG7swg0",
                "yID": "u7__TG7swg0"
            }
        ]
    }
}
